;-----------------------------------------------------------------------
;	名称：Objects.ahk
;	機能：オブジェクト操作
;	ver.0.1.4.719 .... 2021/7/23
;-----------------------------------------------------------------------

;----------------------------------------------------------------------
;	オブジェクトの要素数を数える
;----------------------------------------------------------------------
CountObject(_obj)
{
	_cnt := 0
	enum := _obj._NewEnum()
	While enum[k, v]
	{
		_cnt := _cnt + 1
	}
	return _cnt
}
;----------------------------------------------------------------------
;	オブジェクトの要素を削除
;----------------------------------------------------------------------
RemoveObject(_obj)
{
	if(isObject(_obj)) {
		loop
		{
			_cnt := 0
			enum := _obj._NewEnum()
			While enum[k, v]
			{
				_obj.Remove(k,k)
				_cnt := _cnt + 1
			}
			if(_cnt == 0)
				break
		}
	}
}
;----------------------------------------------------------------------
;	オブジェクトの要素リストを返す
;----------------------------------------------------------------------
listSimulMode(_Romaji)
{
	global g_SimulMode
	
	_ddlist := ""
	enum := g_SimulMode._NewEnum()
	While enum[k, v]
	{
		if(substr(v,1,1)==_Romaji) {
			_ddlist := ddlist . v . "|"
		}
	}
	return _ddlist
}
